{
    "Username already in use": "Nom d'utilisateur déjà utilisé",
    "User created successfully": "Utilisateur créé avec succès",
    "Oops... Something occurred in the create user endpoint": "Oups... Quelque chose s'est produit dans le point de terminaison de création d'utilisateur",
    "Oops... Something occurred in the get profile endpoint": "Oups... Quelque chose s'est produit dans le point de terminaison de récupération de profil",
    "Please login": "Veuillez vous connecter",
    "User does not have an address to update": "L'utilisateur n'a pas d'adresse à mettre à jour",
    "User not found": "Utilisateur non trouvé",
    "Wrong role id passed": "Mauvais ID de rôle transmis",
    "User ID is required": "L'ID utilisateur est requis",
    "Oops... Something occurred in the get user endpoint": "Oups... Quelque chose s'est produit dans le point de terminaison de récupération d'utilisateur",
    "Oops... Something occurred in the get all users endpoint": "Oups... Quelque chose s'est produit dans le point de terminaison de récupération de tous les utilisateurs",
    "Incorrect credentials": "Identifiants incorrects",
    "Cannot Login, you are fired": "Impossible de se connecter, vous êtes licencié",
    "Meet support or admin to assign a role to you": "Rencontrez le support ou l'administrateur pour vous attribuer un rôle",
    "Login successful": "Connexion réussie",
    "Please select a role to continue": "Veuillez sélectionner un rôle pour continuer",
    "Oops... Something occurred in the login endpoint": "Oups... Quelque chose s'est produit dans le point de terminaison de connexion",
    "Staff does not exist or fired": "Le personnel n'existe pas ou a été licencié",
    "Oops... Something occurred in the get staff by name endpoint": "Oups... Quelque chose s'est produit dans le point de terminaison de récupération du personnel par nom",
    "Invalid page or documentCount": "Page ou documentCount invalide",
    "Invalid Id Type": "Type d'ID invalide",
    "User deleted successfully": "Utilisateur supprimé avec succès",
    "Oops... Something occurred in delete endpoint": "Oups... Quelque chose s'est produit dans le point de terminaison de suppression",
    "User status updated successfully": "Statut de l'utilisateur mis à jour avec succès",
    "Room created successfully": "Chambre créée avec succès",
    "Oops... Something occurred in the create room endpoint": "Oups... Quelque chose s'est produit dans le point de terminaison de création de chambre",
    "Oops... Something occurred in the get all room endpoint": "Oups... Quelque chose s'est produit dans le point de terminaison de récupération de toutes les chambres",
    "Missing required query param <roomId>": "Paramètre de requête obligatoire manquant <roomId>",
    "Room not found": "Chambre non trouvée",
    "Oops... Something occurred in the get room endpoint": "Oups... Quelque chose s'est produit dans le point de terminaison de récupération de chambre",
    "Missing required query param <locationId>": "Paramètre de requête obligatoire manquant <locationId>",
    "Location not found.": "Emplacement non trouvé.",
    "There is no room for this location": "Il n'y a pas de chambre pour cet emplacement",
    "Oops... Something occurred in the get room by location endpoint": "Oups... Quelque chose s'est produit dans le point de terminaison de récupération de chambre par emplacement",
    "Location not found": "Emplacement non trouvé",
    "Room details not found": "Détails de la chambre non trouvés",
    "Room updated successfully": "Chambre mise à jour avec succès",
    "Room deleted successfully": "Chambre supprimée avec succès",
    "The selected room does belong to the location chosen": "La chambre sélectionnée appartient à l'emplacement choisi",
    "A task for this room in the specified location already exists": "Une tâche pour cette chambre dans l'emplacement spécifié existe déjà",
    "Room details are empty. Cannot create a task.": "Les détails de la chambre sont vides. Impossible de créer une tâche.",
    "Failed to create task.": "Échec de la création de la tâche.",
    "Task created successfully": "Tâche créée avec succès",
    "Attempted to assign a room to a fired employee": "Tentative d'attribuer une chambre à un employé licencié",
    "Missing required query param <taskId>": "Paramètre de requête obligatoire manquant <taskId>",
    "Task submitted": "Tâche soumise",
    "Task not found.": "Tâche non trouvée.",
    "Missing required fields": "Champs obligatoires manquants",
    "Task updated successfully": "Tâche mise à jour avec succès",
    "Task deleted successfully": "Tâche supprimée avec succès",
    "There is no room currently.": "Il n'y a actuellement aucune chambre.",
    "Image Uploaded": "Image téléchargée",
    "There is no room to supervise currently.": "Il n'y a actuellement aucune chambre à superviser.",
    "Approved": "Approuvé",
    "Role added": "Rôle ajouté",
    "Cannot assign the same role to a user": "Impossible d'attribuer le même rôle à un utilisateur",
    "Roles assigned successfully": "Rôles attribués avec succès",
    "Role deleted": "Rôle supprimé",
    "Permission already exists": "La permission existe déjà",
    "A permission you want to add to this role already exists": "Une permission que vous souhaitez ajouter à ce rôle existe déjà",
    "Permissions assigned successfully": "Permissions attribuées avec succès",
    "No permission has been assigned to this role": "Aucune permission n'a été attribuée à ce rôle",
    "Permission removed": "Permission supprimée",
    "Permission not found or not modified": "Permission non trouvée ou non modifiée",
    "Location already exists": "L'emplacement existe déjà",
    "New Location added": "Nouvel emplacement ajouté",
    "Location updated successfully": "Emplacement mis à jour avec succès",
    "Location deleted": "Emplacement supprimé",
    "A work order has not been created for this room hence no history": "Aucun ordre de travail n'a été créé pour cette chambre, donc aucun historique",
    "This cleaner has not been assigned a work order yet": "Ce nettoyeur n'a pas encore été affecté à un ordre de travail",
    "This inspector has not been assigned a work order yet": "Cet inspecteur n'a pas encore été affecté à un ordre de travail",
    "User role deleted successfully": "Rôle utilisateur supprimé avec succès"
}
